{
    "locales": {
        "ru": "Russian",
        "en": "English"
    },
    "navbar": {
        "about": "About Me",
        "resume": "Resume",
        "project": "Project",
        "contact": "Contact"
    },
    "name": "Aleksandr Cherednichenko",
    "profession": "Frontend developer",
    "call": "Call",
    "write": "Write",
    "follow": "Follow",
    "hello": "Hello",
    "previewText": "I am a frontend developer with over two years of experience. Two of which are commercial experience working on high-quality and high-load projects. For the past year, I have been mainly working with the Vue 3 framework, a modern and concise framework for creating web interfaces. I have a showcase of amazing web applications that I have built. I am proficient in HTML, SCSS, JavaScript, Vue 3 and other web technologies. I also have a flair for design and base proficiency with graphic design applications (e.g., Figma). I was born in Magnitogorsk, but I moved to Saint Petersburg to pursue my passion in this field. Currently, I am living in Thailand and looking for remote work.",
    "usefulTitle": "I can be a valuable asset for potential employers because:",
    "useful": {
        "1": "A proven track record of delivering high-quality web applications with Vue 3",
        "2": "Excellent communication and collaboration skills",
        "3": "A keen interest in learning new technologies and best practices",
        "4": "I have a flexible and adaptive mindset"
    },
    "experience": "Experience",
    "education": "Education",
    "skills": "Skills",
    "work1": {
        "name": "Reelmotion Games",
        "description": "Компания специализирующаяся на разработке уникальных гемблинг проектов для онлайна, а так же на социальные проекты и i-gaming индустрию",
        "location": "Saint Petersburg - Thailand",
        "position": "Frontend-developer",
        "period": "07.2022 - Present",
        "skills": "html,sass,git,js,vue"
    },
    "work2": {
        "name": "AT-Work",
        "description": "A company engaged in the development of a service that includes the search and hiring of specialists, the placement of advertisements for the sale of goods, as well as the selection of service providers.",
        "location": "Saint Petersburg",
        "position": "Frontend-developer",
        "period": "07.2021 - 07.2022",
        "skills": "html,sass,git,js"
    },
    "work3": {
        "name": "Fl.ru",
        "description": "Fulfillment of orders from freelance exchanges, development of static pages",
        "location": "Saint Petersburg",
        "position": "HTML-developer",
        "period": "01.2021 - 07.2022",
        "skills": "html,sass"
    },
    "education1": {
        "name": "NOSOV MAGNITOGORSK STATE TECHNICAL UNIVERSITY",
        "description": "",
        "location": "Magnitogorsk",
        "position": "Industrial and civil construction",
        "period": "09.2014 - 06.2020"
    },
    "education2": {
        "name": "MAGNITOGORSK INDUSTRIAL COLLEGE",
        "description": "",
        "location": "Magnitogorsk",
        "position": "Computer software and automated systems",
        "period": "09.2009 - 06.2013"
    },
    "project1": {
        "name": "My personal website",
        "description": "My website is a portfolio. The project is written in Vue 3 Composition API, in conjunction with the Vite builder. Used: EsLint, i18n. I developed the design based on examples of methods found on the Internet.",
        "link": "https://github.com/AleksandrCherednichenko-developer/My-personal-site",
        "image": "image-1"
    },
    "project2": {
        "name": "Integration OpenAI API",
        "description": "Integration of the public OpenAI API in a Vue project. This project was conceived for a more accessible understanding and use of AI. Some components and functions, as well as texts used in the project, were generated by AI. The project is currently on hold.",
        "link": "https://github.com/AleksandrCherednichenko-developer/MyProject-OpenAI",
        "image": "image-2"
    },
    "project3": {
        "name": "Create a letter of recommendation",
        "description": "In this project, the functionality of creating a recommendation letter is implemented. The project was written in vanilla JS. During the data entry process, the already filled data is saved.",
        "link": "https://github.com/AleksandrCherednichenko-developer/letter_of_recomendation",
        "image": "image-3"
    },
    "project4": {
        "name": "Create a new resume",
        "description": "A project to create a new resume for a portal similar to HH. Written using the Sass preprocessor, the main functionality is written in vanilla JS.",
        "link": "https://github.com/AleksandrCherednichenko-developer/New_resume",
        "image": "image-4"
    },
    "project5": {
        "name": "Ad display page",
        "description": "A page for displaying job vacancies on the site, for finding potential employees. The functionality to remember selected search filters has been implemented. Further integration was carried out with the Bitrix CMS.",
        "link": "https://github.com/AleksandrCherednichenko-developer/Employment",
        "image": "image-5"
    }
}
