{
	"locales": {
		"ru": "Russian",
		"en": "English"
	},
	"morning": "Доброе утро!",
	"afternoon": "Добрый день!",
	"evening": "Добрый вечер!",
	"night": "Доброй ночи!",
	"navbar": {
		"about": "Обо мне",
		"resume": "Резюме",
		"project": "Проекты",
		"contact": "Контакты"
	},
	"name": "Aleksandr Cherednichenko",
	"profession": "Frontend-разработчик / Тимлид",
	"call": "Телефон",
	"write": "Почта",
	"follow": "Контакты",
	"hello": "Здравствуйте",
	"previewText": "Привет! Я — Александр, фронтенд-инженер, прошедший путь от Junior-разработчика до Тимлида и Project Manager. Создаю быстрые и надёжные веб-приложения на Vue, Nuxt, Vite, TypeScript и современном инструментариі. Веду кросс-функциональные команды по полному циклу, связываю цели бизнеса с инженерной реализацией и повышаю эффективность разработки за счёт чистой архитектуры, тестов и автоматизации. Ищу продуктовые международные команды, где смогу приносить ощутимый результат и развиваться дальше. С радостью отвечу на вопросы.",
	"usefulTitle": "Я могу быть ценным сотрудником, потому что:",
	"useful": {
		"1": "Довожу до продакшена веб-приложения на Vue/Nuxt с понятной зоной ответственности",
		"2": "Руководил кросс-функциональной командой из 9 человек (FE, BE, QA, дизайн, аналитика)",
		"3": "Улучшаю перфоманс, DX и скорость релизов с помощью тестирования и CI/CD",
		"4": "Чётко коммуницирую со стейкхолдерами и превращаю цели в выпущенные фичи"
	},
	"experience": "Опыт работы",
	"education": "Образование",
	"skills": "Навыки",
	"work1": {
		"name": "Reelmotion Games",
		"description": "Начал работу в компании на позиции Junior Frontend Developer и вырос до Team Lead / Project Manager, руководя кросс-функциональной командой из болкее чем 10 челове (frontend, backend, QA, дизайн, аналитика). Отвечаю за полный цикл разработки ключевых веб-продуктов — как клиентских, так и внутренних, обеспечивающих стабильную работу и развитие компании.<br><br>Разработал и поддерживаю три основных клиентских веб-платформы, которыми ежедневно пользуются тысячи пользователей для взаимодействия с сервисами компании. В настоящий момент руковожу разработкой четвёртой версии продукта с улучшенной масштабируемостью, UX и модульной архитектурой. Параллельно спроектировал и внедрил внутренние системы: панель администрирования платформы и финансовую систему для управления сменами, выплатами и аналитикой в реальном времени.<br><br>Среди достижений — повышение эффективности релизов на 40%, снижение количества критических багов более чем на 30%, ускорение работы фронтенда и времени сборки благодаря оптимизации архитектуры и пайплайнов. Внедрил CI/CD, автоматическое тестирование (Vitest) и стандарты документации, что повысило стабильность и качество поставки.<br><br>Как тимлид, организовывал Agile-процессы, проводил планирование и ретроспективы, наставлял разработчиков и обеспечивал чёткую коммуникацию между технической и продуктовой сторонами. Регулярно взаимодействовал со стейкхолдерами для согласования приоритетов бизнеса и технических возможностей. Сочетание инженерных и управленческих компетенций позволило добиться стабильной поставки, роста команды и повышения качества продуктов.",
		"position": "Team Lead / Project Manager",
		"period": "07.2022 - По н.в.",
		"skills": "html,sass,git,js,typescript,vue,nuxt,vite,pinia"
	},
	"work2": {
		"name": "AT-Work",
		"description": "Работал фронтенд-разработчиком над многофункциональной HR и e-commerce платформой, объединяющей подбор персонала, торговлю товарами и видеосвязь. Активно взаимодействовал с backend-разработчиками, дизайнерами и QA, реализуя сложные пользовательские сценарии и повышая стабильность продукта.<br><br>Разрабатывал интерактивные UI-компоненты, панели и внутренние модули на HTML, SCSS и JavaScript. Участвовал в интеграции REST API и реализации обновлений в реальном времени для видео-сессий и чатов. Помогал проектировать алгоритмы сопоставления кандидатов с вакансиями, оптимизируя скорость запросов и удобство интерфейса.<br><br>Внёс ряд улучшений в процесс разработки — создал переиспользуемые компоненты, ускорил сборку и оформил стандарты для фронтенда. Помогал QA с тестированием и отладкой, а также поддерживал плотную коммуникацию с продакт-командой для уточнения требований. Этот проект укрепил моё понимание полного цикла разработки и командной работы в продуктовой среде.",
		"position": "Frontend Developer",
		"period": "07.2021 - 07.2022",
		"skills": "html,sass,git,js"
	},
	"work3": {
		"name": "Fl.ru",
		"description": "Начинал карьеру как фриланс-разработчик, создавая статические и полуинтерактивные сайты для малого бизнеса и частных клиентов. Вёл проекты от сбора требований и адаптивной вёрстки до финального деплоя.<br><br>Сосредоточился на чистой, семантической HTML-разметке и модульных SCSS-стилях, параллельно прокачивая JavaScript. Получил опыт управления несколькими проектами одновременно, общения с заказчиками и балансировки сроков и качества.<br><br>Этот ранний опыт сформировал чувство ответственности, гибкости и клиентоориентированности — качества, которые до сих пор помогают мне в инженерной работе и командных взаимодействиях.",
		"position": "HTML Developer / Фриланс",
		"period": "01.2021 - 07.2022",
		"skills": "html,sass,js"
	},
	"education1": {
		"name": "МАГНИТОГОРСКИЙ ГОСУДАРСТВЕННЫЙ ТЕХНИЧЕСКИЙ УНИВЕРСИТЕТ НОСОВА",
		"description": "",
		"location": "Магнитогорск",
		"position": "Промышленное и гражданское строительство",
		"period": "09.2014 - 06.2020"
	},
	"education2": {
		"name": "МАГНИТОГОРСКИЙ ИНДУСТРИАЛЬНЫЙ КОЛЛЕДЖ",
		"description": "",
		"location": "Магнитогорск",
		"position": "Программное обеспечение вычислительной техники и автоматизированных систем",
		"period": "09.2009 - 06.2013"
	}
}
